app/controllers/admin_controller.rb

  def register
    @user = User.new(:registration_key => Digest::SHA1.hexdigest(rand.to_s))
    if request.post?
      logger.info params[:user_email]
      logger.info params[:user_password]
      logger.info params[:user_password_confirmation]
      @user.attributes = params[:user]
      flash[:notice] = "An email has been sent to #{@user.email} with a link to complete your registration"
      redirect_to :home and return if @user.save
---
INSERT INTO "users" ("salt", "updated_at", "hashed_password", "registration_key", "email", "created_at") VALUES('701879673684000.350886305712768', '2009-11-19 23:40:34', '998c89ff689f3d19c9b1ceaabad362c20a4f6963', 'fd9826957c12915b23302bc8ab7d3630a0bf0564', 'curtis.cooley@gmail.com', '2009-11-19 23:40:34')

  def validate
    @user = User.find(params[:id])
    if (@user && @user.registration_key == params[:registration_key])
      @user.registration_key = nil
      @user.schedules << Schedule.new(:name => "#{@user.email}'s Team",
                                      :notification_days => 4,
                                      :minimum_players => 0)
      @user.save
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "registration_key" = NULL, "updated_at" = '2009-11-04 21:00:06' WHERE "id" = 20