app/controllers/games_controller.rb

  def index
    @games = User.find_by_id(session[:user_id]).games
---
SELECT * FROM "games" WHERE ("games".user_id = 996332877)
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def create
    @game = Game.new(params[:game])
    @game.user_id = session[:user_id]

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("opponent", "updated_at", "game_time", "note", "user_id", "location", "created_at") VALUES(NULL, '2009-11-12 01:50:21', NULL, NULL, NULL, NULL, '2009-11-12 01:50:21')

  def update
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)
DELETE FROM "games" WHERE "id" = 953125641