app/controllers/players_controller.rb

  def index
    @players = User.find_by_id(session[:user_id]).players
---
SELECT * FROM "players" WHERE ("players".user_id = 953125641)
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1

  def show
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 953125641)

  def edit
    @player = Player.find_by_id(params[:id]) || Player.new
    @player.user = User.find(session[:user_id])
    if request.post?
      @player.attributes = params[:player]
      redirect_to :action => 'index' and return if @player.save
---
SELECT * FROM "players" WHERE ("players"."id" = '953125641') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
INSERT INTO "players" ("name", "updated_at", "user_id", "email", "created_at") VALUES(NULL, '2009-11-12 01:50:22', NULL, NULL, '2009-11-12 01:50:22')

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT * FROM "players" WHERE ("players"."id" = 953125641)
DELETE FROM "players" WHERE "id" = 953125641

  def reminder
    User.all.each { |user|
      upcoming_games(user).each { |game|
        UserMailer.deliver_reminder_email(Player.find_all_by_user_id(user.id), game, user)
---
SELECT * FROM "users"
SELECT * FROM "players" WHERE ("players"."user_id" = 996332877)