app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
INSERT INTO "users" ("salt", "updated_at", "hashed_password", "player_id", "registration_key", "email", "created_at") VALUES('703112802169800.142487280683331', '2009-11-11 21:23:21', 'e8587bfea7370f98d2e867b9be5b36bf7927b15a', NULL, '2396e316857bed7cb07da7c01a64372004ea5027', 'the_email@here.ca', '2009-11-11 21:23:21')
---
  def edit
    @user = User.find_by_id(params[:id])
    if @user == nil
      @user = User.new
      @user.end_date = 1.day.ago
    end
    if request.post?
      @user.attributes = params[:user]
      redirect_to :action => 'index' and return if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :email)

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
DELETE FROM "users" WHERE "id" = 953125641
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy